In [1]:
import pandas as pd

# 시리즈 만들기

In [2]:
s=pd.Series(['banana',42])
s

0    banana
1        42
dtype: object

In [12]:
s=pd.Series(['Wes McKinney','Creater of Pandas'])
s.index=['Who','per']
s

Who         Wes McKinney
per    Creater of Pandas
dtype: object

### 인덱스에 문자열 넣기

In [9]:
s=pd.Series(['Wes Mc','Creator'],index=['Person','Who'])
s

Person     Wes Mc
Who       Creator
dtype: object

# 데이터프레임 만들기

In [14]:
df=pd.DataFrame(
    {'Name':['R.F','W.G'],
     'Occupation':['C','S'],
     'Born':['9999-999-99','9999-99-99']
    }
)
df

  Name Occupation         Born
0  R.F          C  9999-999-99
1  W.G          S   9999-99-99

### 인덱스에 문자열, 컬럼명 넣기

In [16]:
df=pd.DataFrame(
    data={'Name':['R.F','W.G'],
     'Occupation':['C','S'],
     'Born':['9999-999-99','9999-99-99']},
    index=['R.F','W.G'],
    columns=['Name','Born','Occupation']
)
df

    Name         Born Occupation
R.F  R.F  9999-999-99          C
W.G  W.G   9999-99-99          S

### 데이터프레임의 데이터 순서 보장하여 만들기

In [26]:
scientists=pd.DataFrame(data=
                        {'Occupation':['Chemist','Statistician'],
                         'Born':['1920-07-26','1876-06-13'],
                         'Died':['1958-04-16','1937-10-16'],
                         'Age':[37,61]},
    index=['Rosalin Franklin','William Gosset'],
    columns=['Occupation','Born','Died','Age']
)
scientists

                    Occupation        Born        Died  Age
Rosalin Franklin       Chemist  1920-07-26  1958-04-16   37
William Gosset    Statistician  1876-06-13  1937-10-16   61

# 데이터프레임에서 시리즈 선택하기

In [27]:
scientists.loc['William Gosset']

Occupation    Statistician
Born            1876-06-13
Died            1937-10-16
Age                     61
Name: William Gosset, dtype: object

### 데이터프레임에서 인덱스명 'William Gosset'의 데이터 선택하고 데이터 타입 확인하기

In [28]:
type(scientists.loc['William Gosset'])

pandas.core.series.Series

In [29]:
scientists.loc['William Gosset']

Occupation    Statistician
Born            1876-06-13
Died            1937-10-16
Age                     61
Name: William Gosset, dtype: object

# index, values, keys 사용하기

### 인덱스 속성 사용하기

In [30]:
scientists.index

Index(['Rosalin Franklin', 'William Gosset'], dtype='object')

### 시리즈의 데이터 확인하기

In [31]:
scientists.values

array([['Chemist', '1920-07-26', '1958-04-16', 37],
       ['Statistician', '1876-06-13', '1937-10-16', 61]], dtype=object)

### 인덱스 확인히기 (2)

In [32]:
scientists.keys

<bound method NDFrame.keys of                     Occupation        Born        Died  Age
Rosalin Franklin       Chemist  1920-07-26  1958-04-16   37
William Gosset    Statistician  1876-06-13  1937-10-16   61>

### 인덱스 첫번째 값 추출

In [34]:
scientists.index[1]

'William Gosset'

### 인덱스 첫번째 값 추출(2)

In [35]:
scientists.keys()[1]

'Born'

# 시리즈의 mean, min, max, std 메서드 사용하기

### 'ages', 'occupations' 시리즈 생성

In [37]:
ages=scientists['Age']
occupations=scientists['Occupation']

### 2개 이상의 시리즈 연결 ('age','ocupation')

In [38]:
ages.append(occupations)

Rosalin Franklin              37
William Gosset                61
Rosalin Franklin         Chemist
William Gosset      Statistician
dtype: object

### 산술평균

In [39]:
ages.mean()

49.0

### 최솟값

In [40]:
ages.min()

37

### 최대값

In [41]:
ages.max()

61

### 표준편차

In [43]:
ages.std()

16.97056274847714

### 요약통계량

In [45]:
ages.describe()

count     2.000000
mean     49.000000
std      16.970563
min      37.000000
25%      43.000000
50%      49.000000
75%      55.000000
max      61.000000
Name: Age, dtype: float64

### 중복값제거

In [47]:
ages.drop_duplicates()

Rosalin Franklin    37
William Gosset      61
Name: Age, dtype: int64

### 시리즈에 해당값을 가진 요소가 있는지 확인

In [51]:
ages.equals(occupations)

False

### 시리즈에 포함된 값이 있는지 확인

In [50]:
ages.isin([37])

Rosalin Franklin     True
William Gosset      False
Name: Age, dtype: bool

### 중간값

In [52]:
ages.median()

49.0

### 특정값을 가진 시리즈로 교체

In [57]:
ages.replace(37,99)

Rosalin Franklin    99
William Gosset      61
Name: Age, dtype: int64

### 시리즈에서 임의의 값을 반환

In [58]:
ages.sample()

William Gosset    61
Name: Age, dtype: int64

### 시리즈를 데이터프레임으로 변환

In [59]:
ages.to_frame()

                  Age
Rosalin Franklin   37
William Gosset     61

### Scientists dataframe을 'Age'기준으로 내림차순 정렬

In [61]:
scientists.sort_values(by='Age',ascending=False)

                    Occupation        Born        Died  Age
William Gosset    Statistician  1876-06-13  1937-10-16   61
Rosalin Franklin       Chemist  1920-07-26  1958-04-16   37

# 시리즈와 불린 추출 사용하기

### .csv 불러오기 (C:\\Github\\Pandas\\doit\data\\scientists.csv)

In [62]:
df=pd.read_csv("C:\\Github\\Pandas\\doit\data\\scientists.csv")
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

### 'ages' 시리즈 만들고 최대값 구하기

In [64]:
ages=df['Age']
ages.max()

90

### 중간값 구하기

In [65]:
ages.mean()

59.125

### 데이터별로 평균나이보다 적은지 아닌지 보여주기

In [67]:
ages>ages.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

### 평균 나이보다 나이가 많은 사람의 데이터 추출

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

### 참인 인덱스의 데이터만 추출 (데이터별 참/거짓 임의 설정)

0    37
1    61
4    56
5    45
7    77
Name: Age, dtype: int64

# 시리즈와 브로드캐스팅

###  벡터로 더하기 연산 (age)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

### 벡터로 곱하기 연산 (age)

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

### 벡터에 스칼라 (100 더하기)

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

### 벡터에 스칼라 연산 (2 곱하기)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

### 길이가 서로 다른 벡터 연산 (age 시리즈와 pd.Series[1,100] 연산)

0      1
1    100
dtype: int64

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

### 데이터를 인덱스의 내림차순으로 정렬하기 (변수명 rev_ages)

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

### 벡터와 벡터 연산하기 (ages, rev_ages)

In [171]:
ages+rev_ages 의 값을 예상해보라

SyntaxError: invalid syntax (<ipython-input-171-0c770480fc09>, line 1)

# 데이터프레임과 불린 추출

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [155]:
print(scientists.loc[[True,True,False,True,True,True,False,True]])

                Name        Born        Died  Age     Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37        Chemist
1     William Gosset  1876-06-13  1937-10-16   61   Statistician
3        Marie Curie  1867-11-07  1934-07-04   66        Chemist
4      Rachel Carson  1907-05-27  1964-04-14   56      Biologist
5          John Snow  1813-03-15  1858-06-16   45      Physician
7       Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [153]:
scientists*2

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

# 데이터프레임과 브로드캐스팅

# 열의 자료형 바꾸기와 새로운 열 추가하기

# 시리즈, 데이터프레임의 데이터 섞어보기

# 데이터프레임의 열 삭제하기

# 피클 형식으로 저장하기

# CSV 불러오기